import React from "react";
import styles from "./TermsAndConditions.module.css";

const TermsAndConditions = () => {
  return (
    <div className="flex h-screen flex-col items-center space-y-60 p-[20px] text-white md:p-[40px] lg:p-[50px] xl:p-[60px]">
      <p className="text-2xl font-bold">الشروط و الأحكام</p>
      <p dir="rtl" className="text-justify text-[18px] font-medium ">
        تقدم منصة كيبروز ووركشوبز (KI-BROS Workshops) دوراتٍ تدريبيةٍ متخصصةٍ في
        مجال التصوير والجرافيكس، وننوه أن جميع محتويات المنصة والدروس المقدمة هي
        نتاج اجتهادٍ مهنيٍ وعمليِ دام لأكثر من 15 سنة، لذلك فإن محتويات المنصة
        والدروس المقدمة فيها ليست أكاديمية بالمعنى الأول، تقع إدارة المنصة تحت
        شركة داود وياسر ش.م.م وهي شركةٌ محدودة المسؤولية ويقع مركزها الرئيسي في
        بوشر بمحافظة مسقط، وتحمل رقم تعريف ضريبي “OM1100203589“ وسوف يشار إليها
        لاحقاً “بالمنصة”. تحكم هذه الشروط والأحكام استخدام موقع المنصة عبر
        الويب، والتطبيقات والمنتجات الأخرى، لذلك يرجى قراءة الشروط بعناية
        والاتصال بنا في حال وجود أي ملاحظات أو شكاوى تود الإدلاء بها، ولذلك فإن
        النقر على “موافق” عند إنشاء حساب لك يعني أنك توافق على الالتزام بهذه
        الشروط والأحكام، في حال الزيارة العرضية للمنصة فإنك توافق كذلك على
        الاتفاقية هذه دون قيد أو شرط. الفئات المسموح لها باستخدام المنصة. بشكلٍ
        عام لا يجوز استخدام أيِّ من خدماتنا المدفوعة والمقدمة عبر المنصة دون
        إنشاء حساب، ويتم ذلك عن طريق ملئ الاستمارة المعدة لذلك، وعليه فإنه
        وجوباً عندما يتم إنشاء الحساب يجب أن يتم تزويدنا بمعلومات دقيقة وكاملة
        ويجب ألا تكون معلوماتٍ خاطئةٍ أو مضللةٍ أو احتيالية أو تحمل بيانات شخصٍ
        آخر غير المستخدم الفعلي، ويقع على عاتق المستخدم تحديث هذه البيانات
        للحفاظ على دقتها واكتمالها، ويحظر على أي مستخدم يقل عمره عن …. عاماً
        الوصول لمحتويات المنصة بأي شكلٍ كان. طبيعة المحتوى محتوى المنصة عبارة عن
        نتاج خبرات أكثر من 15 سنة في مجال التصوير والجرافيكس ، تتمثل في دروس
        مرئية تشرح كل جانب على حدة، والمنصة متجددة بشكل شهري . إن محتوى المنصة
        هو محتوى تعليمي/تدريبي/تفاعلي، ونطاقه يشمل مجال الـ…… فقط، بعض تطبيق بعض
        الدروس قد يتطلب أن تتوفر لدى المستخدم عددٌ من المعدات المتعلقة بالتصوير،
        وكذلك بعض البرامج المتعلقة بالتعديل على الصور، يشمل المحتوى التعليمي
        كيفية استخدام المعدات والتعامل معها واستخدام البرامج المتعلقة بالتصوير
        والتعديل على الصور، تجد الحد الأدنى للمواصفات الفنية للمعدات البرامج في
        الرابط التالي ……..، لذلك فإنه بالموافقة على اتفاقية الشروط والأحكام يقر
        المستخدم بأنه على علم بالمحتوى المتوفر على المنصة علماً نافياً للجهالة.
        الاستخدام يعد إنشاء حساب المستخدم في المنصة بمثابة موافقة على اتفاقية
        الشروط والأحكام؛ فضلاً عن ذلك فإن وصولك لخدمات المنصة بغير هذه الطريقة
        قد يعد انتهاكاً لاتفاقية الشروط والأحكام؛ إلا أنه وبالرغم من ذلك تسري
        أحكام هذه الاتفاقية على كل شخصٍ يصل لمحتويات المنصة بأي شكلٍ آخر.
      </p>
    </div>
  );
};

export default TermsAndConditions;
